### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [92]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df= pd.read_csv(file_to_load)

In [93]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [94]:
Total_Players = len(purchase_df["SN"].value_counts())
Total_Players_df= pd.DataFrame({"Total Players": Total_Players}, index=[0])
Total_Players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [95]:
distinct_items= len(purchase_df["Item ID"].unique())
distinct_items

179

In [96]:
Average_Price=purchase_df["Price"].mean()
Average_Price

3.050987179487176

In [97]:
Number_purchases=purchase_df["Purchase ID"].count()
Number_purchases

780

In [98]:
Total_revenue=purchase_df["Price"].sum()
Total_revenue

2379.77

In [99]:
purchase_analysis_df=pd.DataFrame({"Total Unique Items":[distinct_items],
                                    "Av. Purchase Price":Average_Price,
                                    "Total Purchases":Number_purchases,
                                    "Total Revenue":Total_revenue})
# can also take square brackets off of first item and add , index[0] at the end but that works only if you want one line of data
purchase_analysis_df

   Total Unique Items  Av. Purchase Price  Total Purchases  Total Revenue
0                 179            3.050987              780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [115]:
gender_df=purchase_df[['Gender', 'SN']]
gender_df.head()

  Gender             SN
0   Male        Lisim78
1   Male    Lisovynya38
2   Male     Ithergue48
3   Male  Chamassasya86
4   Male      Iskosia90

In [187]:
#test to make sure new DF has the correct # of rows
gender_df=gender_df.drop_duplicates()
total_count=gender_df['Gender'].count()
total_count

576

In [188]:
Count= gender_df.groupby(["Gender"]).agg("count")
Count

#this will get you the same results as above
    #gender=gender_df.groupby(["Gender"])
    #gender_group = gender.count()
    #gender_group

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [172]:
Percent = (gender_group/total_count)*100
Percent

                              SN
Gender
Female                 14.062500
Male                   84.027778
Other / Non-Disclosed   1.909722

In [185]:
new_gender_df=gender_df.groupby(["Gender"]).agg("count")
new_gender_df

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [186]:
#add percent to gender grouped DF
new_gender_df["Percent of Total"]=(gender_group/total_count)*100
new_gender_df

                        SN  Percent of Total
Gender
Female                  81         14.062500
Male                   484         84.027778
Other / Non-Disclosed   11          1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [139]:
group_test=purchase_df.groupby(["Gender"]).agg([np.mean, sum, 'count',])["Price"]
group_test.head()

                           mean      sum  count
Gender
Female                 3.203009   361.94    113
Male                   3.017853  1967.64    652
Other / Non-Disclosed  3.346000    50.19     15

In [193]:
#average purchase per person
average_purchase_SN= purchase_df.groupby(["Gender", "SN"]).agg(sum)["Price"]
average_purchase_SN
average_attempt=average_purchase_SN.mean()
average_attempt

4.131545138888886

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [6]:
#this is not in the README

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [156]:
# create bins
age_bins = [0,9,14,19,24,29,34,39,90]
#create labels
age_labels = [">10","10-14", "15-19", "20-24","25-29", "30-34", "35-39", "40+"] 

print(len(age_bins))
print(len(age_labels))

9
8

In [157]:
purchase_df["Age Group"] = pd.cut(purchase_df["Age"], age_bins, labels=age_labels)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [207]:
#group by age group
age_demo=purchase_df.groupby("Age Group")
#age_demo_count=purchase_df.groupby("Age Group").agg('count')["SN"] *doesn't work counts all not distinc

In [213]:
distinct_SN=age_demo["SN"].nunique()
distinct_SN

Age Group
>10       17.0
10-14     22.0
15-19    107.0
20-24    258.0
25-29     77.0
30-34     52.0
35-39     31.0
40+       12.0
Name: SN, dtype: float64

In [214]:
age_demo_percent=(distinct_SN/Total_Players)*100
age_demo

In [208]:
age_demo_final_df = age_demo["SN"].nunique()
age_demo_final_df

Age Group
>10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [215]:
age_demo_final_df["Percentage of Players"]=(distinct_SN/Total_Players)*100
age_demo_final_df

TypeError: cannot insert an item into a CategoricalIndex that is not already an existing category

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [160]:
age_analysis = purchase_df.groupby(["Age Group"]).agg(['count', np.mean, sum,])["Price"] 
age_analysis

           count      mean      sum
Age Group
>10           23  3.353478    77.13
10-14         28  2.956429    82.78
15-19        136  3.035956   412.89
20-24        365  3.052219  1114.06
25-29        101  2.900990   293.00
30-34         73  2.931507   214.00
35-39         41  3.601707   147.67
40+           13  2.941538    38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [223]:
Top_spenders = purchase_df.groupby(["SN"]).agg(['count', np.mean, sum,])["Price"]
Top_spenders

               count      mean   sum
SN
Adairialis76       1  2.280000  2.28
Adastirin33        1  4.480000  4.48
Aeda94             1  4.910000  4.91
Aela59             1  4.320000  4.32
Aelaria33          1  1.790000  1.79
...              ...       ...   ...
Yathecal82         3  2.073333  6.22
Yathedeu43         2  3.010000  6.02
Yoishirrala98      1  4.580000  4.58
Zhisrisu83         2  3.945000  7.89
Zontibe81          3  2.676667  8.03

[576 rows x 3 columns]

In [227]:
Sorted_df=Top_spenders.sort_values("sum",ascending=False)
Sorted_df.head(5)

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Chamjask73       3  4.610000  13.83
Iral74           4  3.405000  13.62
Iskadarya95      3  4.366667  13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80